Org/Lagged.org
#+TITLE: Lagged objects in package 'lagged'
#+AUTHOR: Georgi N. Boshnakov
# #+STARTUP: hideblocks
#+PROPERTY: header-args:R  :session *R*
#+PROPERTY: header-args    :results silent
# #+PROPERTY: header-args:R  :tangle ../R/lagged.R  :comments both
#+PROPERTY: header-args:R  :tangle ../R/lagged.R
#+LATEX_CLASS: rpackagearticle

\vspace*{1cm}
This message is printed at the start of the tangled .R file to alert against editing that
file:
#+BEGIN_SRC R
## Do not edit this file manually.
## It has been automatically generated from *.org sources.
#+END_SRC

#+BEGIN_SRC R  :tangle ../tests/testthat/test-Lagged.R
## Do not edit this file manually.
## It has been automatically generated from *.org sources.
#+END_SRC



* Class "Lagged"


"Lagged" is the base lagged class. It is virtual and defines a slot ~data~ from class
"ANY".
#+BEGIN_SRC R
setClass("Lagged", slots = c(data = "ANY"), contains = "VIRTUAL")
                               # setClass("Lagged", slots = c(data = "vector") )
                               # setClass("Lagged", slots = c(data = "structure") )
#+END_SRC

Actual classes inherit from "Lagged" and restrict the data slot.  
#+BEGIN_SRC R
                                               # setClass("X", slots = c(data = "structure"))
setClass("Lagged1d", contains = "Lagged", slots = c(data = "vector") )
setClass("Lagged2d", contains = "Lagged", slots = c(data = "matrix") )
setClass("Lagged3d", contains = "Lagged", slots = c(data = "array") )
                     # TODO: check validity for Lagged3d: 3 dimensional.
#+END_SRC
One special subclass of "Lagged" is "FlexibleLagged", which can represent objects from any
subclass of "Lagged". This is achieved by setting the data slot to be "Lagged" along with
methods for indexing, ~maxLag~, and similar to ensure that the Lagged functionality is
provided. (*NOTE (2019-05-15): adding prototype since the default is puzzling and leaves the
object invalid if slot ~data~ is not set during initialisation. In particular,
~new("FlexibleLagged")~, was returning an invalid object without warning nor error.)
#+BEGIN_SRC R
setClass("FlexibleLagged", contains = "Lagged", slots = c(data = "Lagged"),
         prototype = list(data = new("Lagged1d")) )
#+END_SRC
The initialisation method for "FlexibleLagged" objects does the obvious thing if argument
~data~ is "Lagged". Otherwise it converts argument ~data~ to a suitable "Lagged" object
before assigning it to the data slot. If the function is not able to infer a suitable
"Lagged" class it still passes ~data~ on to the next method which usually leads to an error.

The following convenience function is used to infer a suitable "Lagged" class for argument
~data~:
#+BEGIN_SRC R
.whichNativeLagged <- function(x){
    if(is(x, "Lagged"))
        "FlexibleLagged"
    else if(is.vector(x))
        "Lagged1d"
    else if(is.matrix(x))
        "Lagged2d"
    else if(is.array(x)  && length(dim(x)) == 3)
        "Lagged3d"
    else
        NA

}
#+END_SRC


This is the initialisation method for ="FlexibleLagged"=. Note that it gets rid of recursive
="FlexibleLagged"= data slots, i.e. the data slot of the returned object is "Lagged" but not
"FlexibleLagged".  *TODO:* This probably should be taken care of by a validation method.

*!!! 2019-05-15 Note:* Moving argument data after the ="..."= argument, so that it is matched
     only when explicitly supplied. Otherwise it makes it difficult to use unnamed arguments
     in initialisation of subclasses. The success may depend on the order of the arguments
     and the error message is not helpful. This change is potentially breaking change but it
     seems that ~data~ is always named in existing code.
#+BEGIN_SRC R
setMethod("initialize", "FlexibleLagged",
          function(.Object, ..., data){
              if(missing(data)){
                  res <- callNextMethod(.Object, ...)
                  return(res)
              }

              while(is(data, "FlexibleLagged"))
                  data <- data@data

              if(!is(data, "Lagged")){
                  clname <- .whichNativeLagged(data)
                  if(!is.na(clname))
                      data <- new(clname, data = data)
                  ##else don't know what to do with data, pass it on
                  ##     and let others complain if not appropriate.
              }
              .Object <- callNextMethod(.Object, data = data, ...)

              .Object
          }
          )
#+END_SRC
In general, "FlexibleLagged" can be used as superclass of classes which wish to represent any
possible subclasses of "Lagged". For slots, it is sufficient (and more efficient) to use
"Lagged".

Since class "FlexibleLagged" is special, it has its own implementations of some core methods
defined for "Lagged".

*TODO:* Decide what support to offer for the native S3 class "acf". Turn it into S4 using
~setOldClass~? Or just adapt the various methods and constructors to convert it properly to
Lagged? For now putting some code in ~Lagged()~ to accept "acf" objects.

** Core methods for lagged objects

The methods in this section are ok for objects inheriting from "Lagged". Where
necessary, specialised methods are defined for "FlexibleLagged".


*** Subscripting with "["

Subscripting with ~i~ missing, returns the raw data.
#+BEGIN_SRC R
setMethod("[", c(x = "Lagged", i = "missing"), function(x) x@data )
setMethod("[", c(x = "FlexibleLagged", i = "missing", j = "missing"), function(x) x@data[] )
setMethod("[", c(x = "FlexibleLagged", i = "missing", j = "ANY"), 
          function(x, i, j, ..., drop) x@data[ , j, ..., drop] )
#+END_SRC

When ~i~ is present, indexing depends on the type of the data slot and so is defined by
subclasses. For indices larger than ~maxLag(x)~ the values are filled with NA's.


*TODO:* consider making the 1d method the default one?

For "[", the default for ~drop~ is ~FALSE~.
*TODO:* check that the existing methods follow this convention!

Indexing "FlexibleLagged" simply transfers the operation to the data slot (it is "Lagged").
I created separate methods for ~drop~ since just omitting it from the method signature and setting
~drop = FALSE~ in the signature of the function seems to have no effect (and
~findMethods("FlexibleLagged")~ shows that the default for drop in the method is ~TRUE~).
#+BEGIN_SRC R
setMethod("[", c(x = "FlexibleLagged", i = "numeric", j = "missing", drop = "missing"), 
          function(x, i, ..., drop = FALSE){
#browser()
              if(nargs() == 2)
                  x@data[i] 
              else
                  x@data[i, ] 
          }
          )
setMethod("[", c(x = "FlexibleLagged", i = "numeric", j = "missing", drop = "logical"), 
          function(x, i, ..., drop = FALSE)
              if(nargs() == 3)
                  x@data[i, drop = drop] 
              else
                  x@data[i, , drop = drop] 
          )
#+END_SRC


