Org/Lagged.tex
% Created 2019-05-29 Wed 10:22
% Intended LaTeX compiler: pdflatex
\documentclass[11pt,a4paper]{article}
	      \usepackage[left=1.8cm,right=1.8cm,top=2cm,bottom=2cm]{geometry}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Georgi N. Boshnakov}
\date{\today}
\title{Lagged objects in package 'lagged'}
\hypersetup{
 pdfauthor={Georgi N. Boshnakov},
 pdftitle={Lagged objects in package 'lagged'},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.3.1 (Org mode 9.1.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\vspace*{1cm}
This message is printed at the start of the tangled .R file to alert against editing that
file:
\begin{verbatim}
## Do not edit this file manually.
## It has been automatically generated from *.org sources.
\end{verbatim}



\section{Class "Lagged"}
\label{sec:orgfa847ad}


"Lagged" is the base lagged class. It is virtual and defines a slot \texttt{data} from class
"ANY".
\begin{verbatim}
setClass("Lagged", slots = c(data = "ANY"), contains = "VIRTUAL")
                               # setClass("Lagged", slots = c(data = "vector") )
                               # setClass("Lagged", slots = c(data = "structure") )
\end{verbatim}

Actual classes inherit from "Lagged" and restrict the data slot.  
\begin{verbatim}
                                               # setClass("X", slots = c(data = "structure"))
setClass("Lagged1d", contains = "Lagged", slots = c(data = "vector") )
setClass("Lagged2d", contains = "Lagged", slots = c(data = "matrix") )
setClass("Lagged3d", contains = "Lagged", slots = c(data = "array") )
                     # TODO: check validity for Lagged3d: 3 dimensional.
\end{verbatim}
One special subclass of "Lagged" is "FlexibleLagged", which can represent objects from any
subclass of "Lagged". This is achieved by setting the data slot to be "Lagged" along with
methods for indexing, \texttt{maxLag}, and similar to ensure that the Lagged functionality is
provided. (*NOTE (2019-05-15): adding prototype since the default is puzzling and leaves the
object invalid if slot \texttt{data} is not set during initialisation. In particular,
\texttt{new("FlexibleLagged")}, was returning an invalid object without warning nor error.)
\begin{verbatim}
setClass("FlexibleLagged", contains = "Lagged", slots = c(data = "Lagged"),
         prototype = list(data = new("Lagged1d")) )
\end{verbatim}
The initialisation method for "FlexibleLagged" objects does the obvious thing if argument
\texttt{data} is "Lagged". Otherwise it converts argument \texttt{data} to a suitable "Lagged" object
before assigning it to the data slot. If the function is not able to infer a suitable
"Lagged" class it still passes \texttt{data} on to the next method which usually leads to an error.

The following convenience function is used to infer a suitable "Lagged" class for argument
\texttt{data}:
\begin{verbatim}
.whichNativeLagged <- function(x){
    if(is(x, "Lagged"))
        "FlexibleLagged"
    else if(is.vector(x))
        "Lagged1d"
    else if(is.matrix(x))
        "Lagged2d"
    else if(is.array(x)  && length(dim(x)) == 3)
        "Lagged3d"
    else
        NA

}
\end{verbatim}


This is the initialisation method for \texttt{"FlexibleLagged"}. Note that it gets rid of recursive
\texttt{"FlexibleLagged"} data slots, i.e. the data slot of the returned object is "Lagged" but not
"FlexibleLagged".  \textbf{TODO:} This probably should be taken care of by a validation method.

\textbf{!!! 2019-05-15 Note:} Moving argument data after the \texttt{"..."} argument, so that it is matched
     only when explicitly supplied. Otherwise it makes it difficult to use unnamed arguments
     in initialisation of subclasses. The success may depend on the order of the arguments
     and the error message is not helpful. This change is potentially breaking change but it
     seems that \texttt{data} is always named in existing code.
\begin{verbatim}
setMethod("initialize", "FlexibleLagged",
          function(.Object, ..., data){
              if(missing(data)){
                  res <- callNextMethod(.Object, ...)
                  return(res)
              }

              while(is(data, "FlexibleLagged"))
                  data <- data@data

              if(!is(data, "Lagged")){
                  clname <- .whichNativeLagged(data)
                  if(!is.na(clname))
                      data <- new(clname, data = data)
                  ##else don't know what to do with data, pass it on
                  ##     and let others complain if not appropriate.
              }
              .Object <- callNextMethod(.Object, data = data, ...)

              .Object
          }
          )
\end{verbatim}
In general, "FlexibleLagged" can be used as superclass of classes which wish to represent any
possible subclasses of "Lagged". For slots, it is sufficient (and more efficient) to use
"Lagged".

Since class "FlexibleLagged" is special, it has its own implementations of some core methods
defined for "Lagged".

\textbf{TODO:} Decide what support to offer for the native S3 class "acf". Turn it into S4 using
\texttt{setOldClass}? Or just adapt the various methods and constructors to convert it properly to
Lagged? For now putting some code in \texttt{Lagged()} to accept "acf" objects.

\subsection{Core methods for lagged objects}
\label{sec:org5157877}

The methods in this section are ok for objects inheriting from "Lagged". Where
necessary, specialised methods are defined for "FlexibleLagged".


\subsubsection{Subscripting with "["}
\label{sec:org677e7b4}

Subscripting with \texttt{i} missing, returns the raw data.
\begin{verbatim}
setMethod("[", c(x = "Lagged", i = "missing"), function(x) x@data )
setMethod("[", c(x = "FlexibleLagged", i = "missing", j = "missing"), function(x) x@data[] )
setMethod("[", c(x = "FlexibleLagged", i = "missing", j = "ANY"), 
          function(x, i, j, ..., drop) x@data[ , j, ..., drop] )
\end{verbatim}

When \texttt{i} is present, indexing depends on the type of the data slot and so is defined by
subclasses. For indices larger than \texttt{maxLag(x)} the values are filled with NA's.


\textbf{TODO:} consider making the 1d method the default one?

For "[", the default for \texttt{drop} is \texttt{FALSE}.
\textbf{TODO:} check that the existing methods follow this convention!

Indexing "FlexibleLagged" simply transfers the operation to the data slot (it is "Lagged").
I created separate methods for \texttt{drop} since just omitting it from the method signature and setting
\texttt{drop = FALSE} in the signature of the function seems to have no effect (and
\texttt{findMethods("FlexibleLagged")} shows that the default for drop in the method is \texttt{TRUE}).
\begin{verbatim}
setMethod("[", c(x = "FlexibleLagged", i = "numeric", j = "missing", drop = "missing"), 
          function(x, i, ..., drop = FALSE){
#browser()
              if(nargs() == 2)
                  x@data[i] 
              else
                  x@data[i, ] 
          }
          )
setMethod("[", c(x = "FlexibleLagged", i = "numeric", j = "missing", drop = "logical"), 
          function(x, i, ..., drop = FALSE)
              if(nargs() == 3)
                  x@data[i, drop = drop] 
              else
                  x@data[i, , drop = drop] 
          )
\end{verbatim}
