Org/Lagged.org
*** Subscript-replacement with "[<-"

Similarly to "[", subscript-replacement "[<-" replaces the contents of the data.  The method
for "Lagged" does not check the validity of argument ~value~ but the assignment will
raise an error if it is not appropriate. Subclasses that wish to provide finer control over
this can define suitable methods (e.g. to coerce ~value~ appropriately).
#+BEGIN_SRC R
setReplaceMethod("[", c(x = "Lagged", i = "missing"),
          function(x, i, value){
              x@data <- value
              x
          })
#+END_SRC

Assignment to "FlexibleLagged", when ~i~ is missing, attempts to coerce ~value~ to a suitable
lagged class before assigning it (using ~.whichNativeLagged()~, as the initialisation
function does, but raising an error if unsuccessful). Further methods can be defined using
~"value = xxx"~ in the signature to accommodate additional types or overwrite the default
method here.
#+BEGIN_SRC R
setReplaceMethod("[", c(x = "FlexibleLagged", i = "missing"),
                 function(x, i, value){
                     if(is(value, "FlexibleLagged"))
                         x@data <- value@data
                     else if(is(value, "Lagged"))
                         x@data <- value
                     else{
                         clname <- .whichNativeLagged(value)
                         if(is.na(clname))
                             stop("Don't know what Lagged class to use for this value")
                         else
                             x@data <- new(clname, data = value) # as(value, clname)
                     }
                     x
                 })
#+END_SRC
When ~i~ is present, no attempt is made to coerce it:
#+BEGIN_SRC R
setReplaceMethod("[", c(x = "FlexibleLagged", i = "numeric"),
                 function(x, i, value){
                     x@data[i] <- value # not i+1, since x@data is a "Lagged" object here.
                     x
          })
#+END_SRC

#+BEGIN_SRC R
## Ne, tezi zasega ne gi pravya, pravya vischko bez "value = xxx" - tova pozvolyava da se
## definirat metodi ako tryabva.
##
## setReplaceMethod("[", c(x = "FlexibleLagged", i = "missing", value = "vector"),
##           function(x, i, value){
##               x@data <- as(value, "Lagged1d")
##               x
##           })
##
## setReplaceMethod("[", c(x = "FlexibleLagged", i = "missing", value = "matrix"),
##           function(x, i, value){
##               x@data <- as(value, "Lagged2d")
##               x
##           })
#+END_SRC


*** Methods for "[[" and "[[<-"

Indexing with "[[" returns the value for the specified lag. This is the recommended way to
extract the value at a single index.

This defines a default method. For efficiency specific classes can define versions that avoid
calling the generic "[[". If multi-seasons are supported the check for length equal to one
should be adapted accordingly.
#+BEGIN_SRC R
setMethod("[[", c(x = "Lagged", i = "numeric", j = "missing"),
          function(x, i, j){
              if(length(i) == 1)
                  x[i, drop = TRUE]
              else
                  stop("the length of argument `i' must be equal to one")
          }
          )

setMethod("[[", c(x = "FlexibleLagged", i = "ANY", j = "ANY"),
          function(x, i, j){
              x@data[[i, j]]
          }
          )
setMethod("[[", c(x = "FlexibleLagged", i = "missing", j = "numeric"),
          function(x, i, j){
              x@data[[ , j]]
          }
          )
setMethod("[[", c(x = "FlexibleLagged", i = "numeric", j = "missing"),
          function(x, i, j){
              if(nposargs(sys.call(-1)) == 2) # x[[i]]
                  x@data[[i]]
              else # x[i, ]
                  x@data[[i, ]]
          }
          )
#+END_SRC
Note the use of ~drop = TRUE~.
*TODO:* The use of ~drop = TRUE~ maybe needs some further thought. Maybe something that drops
only the index corresponding to the lag is preferable and such behaviour should be documented!

*Note:* After more thought, ~drop = TRUE~ is excellent for "[[" and could be used in more
    circumstances. 

The replace method works similarly:
#+BEGIN_SRC R
setReplaceMethod("[[", c(x = "Lagged", i = "numeric"),
                 function(x, i, value){
                     if(length(i) == 1)
                         x[i] <- value
                     else
                         stop("the length of argument `i' must be equal to one")
                     x
                 })
#+END_SRC


For "Lagged2d" define further methods. When ~j~ is present the indexing is matrix-like with
~drop = TRUE~. For now restrict this to the case when ~i~ is a single number (but ~j~ can be
a vector). 

*TODO:* It is probably imperative here to distinguish ~x[[i,] ]~ and ~x[[i] ]~
(but this should be done in the method with missing ~j~).
*Done:* Here ~nargs() can't distinguish ~x[i]~ and ~x[i,]~, roughly because ~sys.call()~ is
~.local(x, i, j, ...)~, due to the way S4 methods work. So I use ~nposargs()~. (*TODO:* think
about more efficient version of ~nposargs()~?)

Note that ~x[[i] ]~ is identical to ~x[[ , i] ]~. So, the second definition is technically
redundant. It is there for user's convenience and to avoid an obscure error message
(incidentally, it is currently somewhat more efficient).
#+BEGIN_SRC R
setMethod("[[", c(x = "Lagged2d", i = "numeric", j = "missing"),
          function(x, i, j){
              if(length(i) == 1){
                  if(nposargs(sys.call(-1)) == 2) # x[i] - note the use of -1 in sys.call()
                      x@data[ , i + 1, drop = TRUE]
                  else             # x[i, ]
                      x@data[i, , drop = TRUE]
              }else
                  stop("the length of argument `i' must be equal to one")
          }
          )
setMethod("[[", c(x = "Lagged2d", i = "missing", j = "numeric"),
          function(x, i, j){
              if(length(j) == 1){
                      x@data[ , j + 1, drop = TRUE]
              }else
                  stop("the length of argument `j' must be equal to one")
          }
          )
setMethod("[[", c(x = "Lagged2d", i = "numeric", j = "numeric"),
          function(x, i, j){
              if(length(i) == 1)
                  x@data[i, j + 1, drop = TRUE]
              else
                  stop("the length of argument `i' must be equal to one")
          }
          )
setMethod("[[", c(x = "Lagged2d", i = "numeric", j = "logical"),
          function(x, i, j){
              if(length(i) == 1)
                  x@data[i, j, drop = TRUE]
              else
                  stop("the length of argument `i' must be equal to one")
          }
          )
#+END_SRC





