Org/Lagged.org
*** Arithmetic and other operations (Ops group)

Operations in the ~Ops~ group involving lagged objects are defined "naturally" on their
data. However, they are more restrictive than base R's conventions for atomic objects and do
not follow the recycling rules.

The binary "Ops" methods return values from one of the core lagged classes, even if the
objects are from classes inheriting from "Lagged". The reason is that, for example, the
difference between autocovariance functions is not necessarilly autocovariance, but it is
still a lagged object. It would be very confusing if the result was not guaranteed to be
"Lagged".  Also, if a policy of preserving the actual class were to be adopted, what would
be the rule for the class of the result from binary operations between lagged objects from
different classes (it seems not possible to have a simple one). 


Of course, methods defined for subclasses of lagged objects may preserve the actual classes
when appropriate but should not introduce confusion on indexing.

In the default methods below, the result of these operations is a strict lagged object,
i.e. an object from the core lagged classes (*TODO:* explain). The exact type of lagged
object is determined by the data. The net effect is that the value of the Ops operation is
also a lagged object, a core one, with indexing starting from zero but additional structure
is lost.


*TODO:* Should operations between "Lagged" and base R objects be permitted at all?  For users
of "Lagged" the returned "Lagged" value is natural and expected. But what about users who are
not aware that there are "Lagged" objects among the arguments? What to do when the "ordinary"
argument is of length one - should this be an exception? But then the user may not know that
the length is one, leading to surprises. Also, there is a conceptual difference here between
the additive and multiplicative operations. (All this should be documented in a vignette. It
seems sufficient that the recycling rule is banned. Need to finalise operation with
singletons.)


Operations between two lagged objects give a lagged object. If their ~maxLag()~ properties
are different, the shorter data slot is extended with NA's before applying the binary
operation.


**** "Ops" involving "Lagged"

The unary operators preserve the class of the object:
#+BEGIN_SRC R
setMethod("Ops", c(e1 = "Lagged", e2 = "missing"),
          function(e1){
                    # wrk <- callGeneric(e1@data)
                    # clname <- whichLagged(e1)
                    # new(clname, data = wrk)
              e1@data <- callGeneric(e1@data)
              e1
          })
#+END_SRC

#+BEGIN_SRC R
## TODO: do not allow mixing Lagged1d with Lagged2d, etc.?
setMethod("Ops", c(e1 = "Lagged", e2 = "Lagged"),
          function(e1, e2){
              wrk <- if(length(e1@data) == length(e2@data) ) # TODO: allow %%==0 as elsewhere?
                         callGeneric(e1@data, e2@data)
                     else{
                         maxlag <- max(maxLag(e1), maxLag(e2))
                         v1 <- e1[0:maxlag]
                         v2 <- e2[0:maxlag]
                         callGeneric(v1, v2)
                     }
              clname <- whichLagged(e1, e2)
              new(clname, data = wrk)
          })
#+END_SRC
*TODO:* the current mechanism to decide the lagged class of the return value is not very
satisfactory, see ~whichLagged()~ which encapsulates it. Also, forbid mixing 1d with 2d,
etc.?

When only one of the objects is "Lagged", the operations are defined if the following cases:

    1. the length of the other object is equal to the length of the data part of the "Lagged"
       object,
    2. the other object is of length one,
    3. the other object is a singleton with the same dimensions as a single element of the
       "Lagged" object.

*old todo:* document behaviour if ~length(object@data) == 0~ (minor issue)?

*2017-05-20 TODO:* Change ~length(e1[[0]]) == length(e2))~ below to
                   ~dim(e1[[0]]) == dim(e2))~ but needs more care (note though that the
                   scalar case is covered by ~length(e2) == 1~.

Notice that "vector" in the signatures is the S4 class "vector" (TODO: check!), see
~showClass("vector")~ for its subclasses.
#+BEGIN_EXAMPLE
> is.vector(array(0, dim = c(2,2,2)))    # S3
[1] FALSE

> is(array(0, dim = c(2,2,2)), "vector") # S4
[1] TRUE
#+END_EXAMPLE


#+BEGIN_SRC R
setMethod("Ops", c(e1 = "Lagged", e2 = "vector"),
          function(e1, e2){
              wrk <- if(length(e2) == 1  || length(e1@data) == length(e2)
                             # 2017-05-20 was:
                             #    || length(e2) > 0  && (length(e1@data) %% length(e2)) == 0
                        || length(e2) > 0  && length(e1[[0]]) == length(e2))
                         callGeneric(e1@data, e2)
                     else
                         stop("Incompatible length of operands in a binary operation")

              new(whichLagged(e1), data = wrk)
          })

setMethod("Ops", c(e1 = "vector", e2 = "Lagged"),
          function(e1, e2){
              wrk <- if(length(e1) == 1  || length(e1) == length(e2@data)
                             # 2017-05-20 was:
                             #    || length(e1) > 0  && (length(e2@data) %% length(e1)) == 0
                        || length(e1) > 0  && length(e2[[0]]) == length(e1))
                         callGeneric(e1, e2@data)
                     else
                         stop("Incompatible length of operands in a binary operation")

              new(whichLagged(e2), data = wrk)
          })
#+END_SRC


**** "Ops" involving "FlexibleLagged"

Operations involving "FlexibleLagged" objects use those defined for "Lagged" by operating on
the data slot (which is "Lagged").
#+BEGIN_SRC R
setMethod("Ops", c(e1 = "FlexibleLagged", e2 = "Lagged"),
          function(e1, e2){
              callGeneric(e1@data, e2)
          })

setMethod("Ops", c(e1 = "Lagged", e2 = "FlexibleLagged"),
          function(e1, e2){
              callGeneric(e1, e2@data)
          })

setMethod("Ops", c(e1 = "FlexibleLagged", e2 = "FlexibleLagged"),
          function(e1, e2){
              callGeneric(e1@data, e2@data)
          })


setMethod("Ops", c(e1 = "FlexibleLagged", e2 = "vector"),
          function(e1, e2){
              callGeneric(e1@data, e2)
          })

setMethod("Ops", c(e1 = "vector", e2 = "FlexibleLagged"),
          function(e1, e2){
              callGeneric(e1, e2@data)
          })
#+END_SRC

*TODO:* methods for "matrix", "array", these probably should be for specific "Lagged"
subclasses, like "Lagged2d".


*** "Math" and "Math2" group methods

"Math" and "Math2" methods return the object with its data part transformed by the
corresponding function. 

*TODO:* Does this work for ~FlexibleLagged~?
#+BEGIN_SRC R
setMethod("Math", c(x = "Lagged"),
          function(x){
              x@data <- callGeneric(x@data)
              x
          })
#+END_SRC


#+BEGIN_SRC R
setMethod("Math2", c(x = "Lagged"),
          function(x, digits){
              x@data <- callGeneric(x@data, digits)
              x
          })
#+END_SRC


*** "Summary" group methods

The "Summary" methods operate on the data part of the "Lagged" object.
#+BEGIN_SRC R
setMethod("Summary", c(x = "Lagged"),
          function(x, ..., na.rm = FALSE){
              callGeneric(x@data)
          })
#+END_SRC


