Org/Lagged.org
** S3 methods for as.vector() and related functions for "Lagged"

#+BEGIN_SRC R
## TODO: check if the S3 methods understand S4 inheritance (I think they do)
as.vector.Lagged <- function(x, mode) as.vector(x@data) # todo: use mode?
as.double.Lagged <- function(x, ...)  as.double(x@data ) # note: this is for as.numeric()
as.matrix.Lagged <- function(x, ...)  as.matrix(x@data)
 as.array.Lagged <- function(x, ...)  as.array(x@data)
#+END_SRC
Converting from "Lagged" to base atomic or structure objects applies the requested
operation to the data slot. Define first the generic S3 methods:

Somewhat more efficient methods for these:
#+BEGIN_SRC R
as.vector.Lagged1d <- function(x, mode) x@data
as.matrix.Lagged2d <- function(x, ...) x@data
as.array.Lagged3d  <- function(x, ...) x@data
#+END_SRC


** setAs() methods for "Lagged"

These methods call the corresponding S3 methods defined above:
#+BEGIN_SRC R
setAs("Lagged", "vector", function(from) as.vector(from) )
setAs("Lagged", "matrix", function(from) as.matrix(from) )
setAs("Lagged", "array",  function(from) as.array(from) )
#+END_SRC



** Generic function maxLag()

The default method for =maxLag()= handles objects inheriting from S3 class "acf". In all
other cases it raises an error. Notice that in "acf" the lag is in the first dimension.
#+BEGIN_SRC R
maxLag <- function(object, ...){
   if(inherits(object, "acf"))
       dim(object$acf)[1] - 1
   else
       stop("No applicable method to compute maxLag")
}

setGeneric("maxLag")
#+END_SRC

#+BEGIN_SRC R
setGeneric("maxLag<-", def = function(object, ..., value){ standardGeneric("maxLag<-") } )
#+END_SRC

*TODO:* Do we need a separate method for "FlexibleLagged"?
*Answer (2015-05-16): Yes!
#+BEGIN_SRC R
setReplaceMethod("maxLag", "Lagged",
                 function(object, ..., value){
                     object@data <- object[0:value]
                     object
                 }
                 )

setReplaceMethod("maxLag", "FlexibleLagged",
                 function(object, ..., value){
                     maxLag(object@data) <- value
                     object
                 }
                 )
#+END_SRC

The convention for "Lagged" objects is that the last dimension carries the lag.  So, the
methods for basic objects compute the maximal lag as the last dimention minus one.
#+BEGIN_SRC R
setMethod("maxLag", c(object = "vector"), function(object) length(object) - 1)
setMethod("maxLag", c(object = "matrix"), function(object) ncol(object) - 1 )
setMethod("maxLag", c(object = "array"),
          function(object){
                  d <- dim(object)
                  d[length(d)] - 1
          })
#+END_SRC
Note again that =acf()= puts the lag in the first index.

The ~maxLag()~ method for "Lagged" objects simply calls ~maxLag()~ on the data slot. Classes
inheriting from "Lagged" may define specific methods if the (in)efficiency of this method is
a concern.
#+BEGIN_SRC R
setMethod("maxLag", c(object = "Lagged"), function(object) maxLag(object@data) )
#+END_SRC


** Length of "Lagged" objects - S3 method for length()

The length of "Lagged" objects is defined to be =maxLag(x)+1=, not the length of the data in
the "Lagged" object. In most cases of direct use =maxLag(x)= is more appropriate.

This defines an S3 method for function ~length()~ for "Lagged" objects.
#+BEGIN_SRC R
length.Lagged <- function(x) maxLag(x) + 1
#+END_SRC

*TODO:* Check if other base R functions need S3 methods for "Lagged" objects.




