Org/Lagged.tex


\subsection{S3 methods for as.vector() and related functions for "Lagged"}
\label{sec:orgaa40c0d}

\begin{verbatim}
## TODO: check if the S3 methods understand S4 inheritance (I think they do)
as.vector.Lagged <- function(x, mode) as.vector(x@data) # todo: use mode?
as.double.Lagged <- function(x, ...)  as.double(x@data ) # note: this is for as.numeric()
as.matrix.Lagged <- function(x, ...)  as.matrix(x@data)
 as.array.Lagged <- function(x, ...)  as.array(x@data)
\end{verbatim}
Converting from "Lagged" to base atomic or structure objects applies the requested
operation to the data slot. Define first the generic S3 methods:

Somewhat more efficient methods for these:
\begin{verbatim}
as.vector.Lagged1d <- function(x, mode) x@data
as.matrix.Lagged2d <- function(x, ...) x@data
as.array.Lagged3d  <- function(x, ...) x@data
\end{verbatim}


\subsection{setAs() methods for "Lagged"}
\label{sec:org1436e9d}

These methods call the corresponding S3 methods defined above:
\begin{verbatim}
setAs("Lagged", "vector", function(from) as.vector(from) )
setAs("Lagged", "matrix", function(from) as.matrix(from) )
setAs("Lagged", "array",  function(from) as.array(from) )
\end{verbatim}



\subsection{Generic function maxLag()}
\label{sec:org4f09cdf}

The default method for \texttt{maxLag()} handles objects inheriting from S3 class "acf". In all
other cases it raises an error. Notice that in "acf" the lag is in the first dimension.
\begin{verbatim}
maxLag <- function(object, ...){
   if(inherits(object, "acf"))
       dim(object$acf)[1] - 1
   else
       stop("No applicable method to compute maxLag")
}

setGeneric("maxLag")
\end{verbatim}

\begin{verbatim}
setGeneric("maxLag<-", def = function(object, ..., value){ standardGeneric("maxLag<-") } )
\end{verbatim}

\textbf{TODO:} Do we need a separate method for "FlexibleLagged"?
*Answer (2015-05-16): Yes!
\begin{verbatim}
setReplaceMethod("maxLag", "Lagged",
                 function(object, ..., value){
                     object@data <- object[0:value]
                     object
                 }
                 )

setReplaceMethod("maxLag", "FlexibleLagged",
                 function(object, ..., value){
                     maxLag(object@data) <- value
                     object
                 }
                 )
\end{verbatim}

The convention for "Lagged" objects is that the last dimension carries the lag.  So, the
methods for basic objects compute the maximal lag as the last dimention minus one.
\begin{verbatim}
setMethod("maxLag", c(object = "vector"), function(object) length(object) - 1)
setMethod("maxLag", c(object = "matrix"), function(object) ncol(object) - 1 )
setMethod("maxLag", c(object = "array"),
          function(object){
                  d <- dim(object)
                  d[length(d)] - 1
          })
\end{verbatim}
Note again that \texttt{acf()} puts the lag in the first index.

The \texttt{maxLag()} method for "Lagged" objects simply calls \texttt{maxLag()} on the data slot. Classes
inheriting from "Lagged" may define specific methods if the (in)efficiency of this method is
a concern.
\begin{verbatim}
setMethod("maxLag", c(object = "Lagged"), function(object) maxLag(object@data) )
\end{verbatim}


\subsection{Length of "Lagged" objects - S3 method for length()}
\label{sec:orgef70436}

The length of "Lagged" objects is defined to be \texttt{maxLag(x)+1}, not the length of the data in
the "Lagged" object. In most cases of direct use \texttt{maxLag(x)} is more appropriate.

This defines an S3 method for function \texttt{length()} for "Lagged" objects.
\begin{verbatim}
length.Lagged <- function(x) maxLag(x) + 1
\end{verbatim}

\textbf{TODO:} Check if other base R functions need S3 methods for "Lagged" objects.
