Org/Lagged.tex




\section{Methods for "["}
\label{sec:orgfad224c}

\begin{verbatim}
setMethod("[", c(x = "Lagged1d", i = "numeric"),
          function(x, i, drop) x@data[i+1] )
\end{verbatim}


\textbf{TODO:} Don't give option to change argument \texttt{drop} and raise error if it is present?

\textbf{TODO:} Currently silently ignores argument \texttt{j}. Throw error if it is present?
    Another alternative is to define the current methods with \texttt{j = "missing"} but then
    explicit methods for "ANY" will be needed to avoid some other method matching quietly and
    doing something even less relevant.

\textbf{TODO:} For \texttt{"Lagged2d"}, add argument \texttt{type} to accommodate indexing like \texttt{"slMatrix"}.
    Need some thought to streamline that old stuff. However, it may be better not to put this on
    \texttt{"Lagged2d"} but introduce subclass, say \texttt{"LaggedSL" of ="Lagged2d"} and define modified
    methods for that, streamlining in the process.
    (\textbf{NOTE:} mostly done, see below.)   

2019-05-18: New "[" methods for "Lagged2d". Decided to use argument \texttt{drop} for the argument
corresponding to \texttt{type} in "slMatrix". 

2019-05-25: Decided eventually to handle the difference between \texttt{x[i]} and \texttt{x[i,]}, since
otherwise confusion arises.  Both go to the methods with \texttt{j} missing. The complete solution
is with \texttt{gbutils::nposargs()}). It is used when drop is logical. When drop is missing, it is
sufficient to use \texttt{nargs()} and avoid additional overhead for the most common case, \texttt{x[i]}.
\begin{verbatim}
setMethod("[", c(x = "Lagged2d", i = "numeric", j = "missing", drop = "missing"),
          function(x, i, ..., drop = FALSE){
              if(nargs() == 2)              # x[i]
                  x@data[ , i+1, drop = FALSE] 
              else                          # x[i, ]
                  x@data[i, , drop = FALSE] 
          }
          )

setMethod("[", c(x = "Lagged2d", i = "numeric", j = "missing", drop = "logical"),
          function(x, i, ..., drop = FALSE){
              if(nposargs(sys.call()) == 2) # x[i]
                  x@data[ , i+1, drop = drop]
              else                          # x[i, ]
                  x@data[i, , drop = drop]
          } 
          )
\end{verbatim}

Non-missing \texttt{j}. 
\begin{verbatim}
setMethod("[", c(x = "Lagged2d", i = "numeric", j = "numeric", drop = "missing"),
          function(x, i, j, ..., drop = FALSE)  
              x@data[i, j + 1, drop = FALSE]
          )
setMethod("[", c(x = "Lagged2d", i = "missing", j = "numeric", drop = "missing"),
          function(x, i, j, ..., drop = FALSE)  
              x@data[ , j + 1, drop = FALSE]
          )
\end{verbatim}
This implements (part of?) the functionality of "slMatrix" indexing. I decided to 
use argument \texttt{drop}, even though it is generally not a good idea to overload an argument
designed for another purpose. However, from a more general perspective, \texttt{drop} controls the
shape of the result. 
\begin{verbatim}
setMethod("[", c(x = "Lagged2d", i = "ANY", j = "ANY", drop = "character"),
          ## vedry old code, modelled after the method for 'slMatrix'
          function(x, i, j, ..., drop = "sl"){  
              ## for now, don't write about this method in the documentation;
              ## it will certainly change

              y <- x@data
              period <- nrow(y)
              if(missing(i))
                  i <- 1:nrow(y)
              if(missing(j))
                  j <- 0:maxLag(x)

              ## TODO: should set 'drop = FALSE' when extracting below but keep it for now in
              ##    case old code depends on the current. In particular this is almost
              ##    certainly so when extracting single values.
              switch(drop,
                     ## "sl" is for completeness, it is the default without this method
                     "sl" = {
                         season <- i
                         lag <- pc.omitneg(j, ncol(x)-1)
                         res <- y[season, lag+1]   # lag+1 because lags start from zero
                     },
                     "tt" = {
                         res <- myouter(i, j, function(ii, jj){
                             wrk <- toSeasonPair(ii, jj, period)
                             season <- wrk$season
                             lag <- wrk$lag
                             y[season, lag + 1]
                         }
                         )
                     },
                     "tl" = {
                         season <- toSeason(i, period)
                         lag <- j
                         res <- y[season, lag + 1]      # lag+1 because lags start from zero.
                     },
                     "tl+-" = {
                         if(length(j) == 1){
                             if(j>=0){                   # this works only for scalar  j
                                 season <- toSeason(i, period)
                                 lag <- j
                             }else{
                                 season <- toSeason(i - j, period)
                                 lag <- -j
                             }
                             res <- y[season, lag+1] # lag+1 because lags start from zero.
                         }else{
                             res <- matrix(NA, nrow = length(i), ncol = length(j))
                             for(k in 1:length(j)){
                                 if(j[k] >= 0){         # this works only for scalar  j
                                     season <- toSeason(i, period)
                                     lag <- j[k]
                                 }else{
                                     season <- toSeason(i - j[k], period)
                                     lag <- -j[k]
                                 }
                                 res[ , k] <- y[season, lag+1]#lag+1 as lags start from zero.
                             }
                         }
                     },
                     "t+l,l+-" = {
                         res <- matrix(NA, nrow = length(i), ncol = length(j))
                         for(k in 1:length(j)){
                             res[ , k] <- x[i + j[k], j[k], drop = "tl+-"]
                         }
                     },
                     ## 2016-01-01 TODO: case "co" seems to be meant for j - scalar.
                     "co" = {
                         season <- toSeason(i, period)
                         lag <- j
                         if(lag < 0 || lag > maxLag(x) )
                             res <- 0
                         else{
                             res <- y[season, lag + 1] # lag+1 because lags start from zero.
                         }
                     },
                     stop("Invalid arg. type, must be one of \"sl\", \"tt\" or \"tl\".")
                     )
              res
          }
          )
\end{verbatim}


\begin{verbatim}
setMethod("[", c(x = "Lagged3d", i = "numeric", j = "missing", drop = "missing"),
          function(x, i, ..., drop = FALSE) x@data[, , i+1, drop = FALSE] )
setMethod("[", c(x = "Lagged3d", i = "numeric", j = "missing", drop = "logical"),
          function(x, i, ..., drop = FALSE) x@data[, , i+1, drop = drop] )
\end{verbatim}
